## HackerRank run on MySQL

In [ ]:
/* 
this is sql comment

    Enter your query here and follow these instructions:
    1. Please append a semicolon ";" at the end of the query and enter your query in a single line to avoid error.
    2. The AS keyword causes errors, so follow this convention: "Select t.Field From table1 t" instead of "select t.Field From table1 AS t"
    3. Type your code immediately after comment. Don't leave any blank line.
*/
#Query a count of the number of cities in CITY having a Population larger than .
select count(*) from CITY where population>100000;

In [ ]:
# Query the total population of all cities in CITY where District is California.
select sum(population) from city
where district ='California';

In [ ]:
# Query the average population of all cities in CITY where District is California.
select avg(population) from city
where district ='California';

In [ ]:
# Query the average population for all cities in CITY, rounded down to the nearest integer.
select floor(avg(population)) from city;

In [ ]:
# Query the sum of the populations for all Japanese cities in CITY. The COUNTRYCODE for Japan is JPN.
select sum(population) from city where countrycode='JPN';

In [ ]:
# Query the difference between the maximum and minimum populations in CITY.
select max(population)-min(population) from city;

In [ ]:
# 
/* 
Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, 
but did not realize her keyboard's 0 key was broken until after completing the calculation. 
She wants your help finding the difference between her miscalculation (using salaries with any zeros removed), 
and the actual average salary.
Write a query calculating the amount of error (i.e.actual-miscslculated average monthly salaries), and round it up to the next integer.
*/
SELECT ceil(AVG(Salary)-AVG(REPLACE(Salary,'0',''))) 
FROM EMPLOYEES;

In [ ]:
# Top Earners
/*
We define an employee's total earnings to be their monthly salary*month worked, 
and the maximum total earnings to be the maximum total earnings for any employee in the Employee table. 
Write a query to find the maximum total earnings 
for all employees as well as the total number of employees who have maximum total earnings. 
Then print these values as 2 space-separated integers.
*/
select max(months * salary), count(months * salary) 
from Employee where (months * salary) 
= (select max(months * salary) from Employee);

In [ ]:
# Aggregation Weather Observation Station 2
/*
Query the following two values from the STATION table:
The sum of all values in LAT_N rounded to a scale of  decimal places.
The sum of all values in LONG_W rounded to a scale of  decimal places.
*/

In [ ]:
/*
Query the following two values from the STATION table:

The sum of all values in LAT_N rounded to a scale of 2 decimal places.
The sum of all values in LONG_W rounded to a scale of 2 decimal places.
*/
SELECT 
    ROUND(SUM(LAT_N), 2),
    ROUND(SUM(LONG_W), 2)
FROM STATION;

In [ ]:
# Weather Observation Station 13
/*
Query the sum of Northern Latitudes (LAT_N) from STATION having
values greater than 137.2345 and less than 38.7880. Truncate your answer to 4 decimal places.
*/
SELECT ROUND(SUM(LAT_N),4)
FROM STATION 
WHERE LAT_N BETWEEN 38.7880 AND 137.2345;

In [ ]:
# Weather Observation Station 14
/*
Query the greatest value of the Northern Latitudes (LAT_N) 
from STATION that is less than 137.2345. Truncate your answer to 4 decimal places.
*/
SELECT ROUND(max(LAT_N),4) FROM STATION WHERE LAT_N < 137.2345;

In [ ]:
# Weather Observation Station 15
/*
Query the Western Longitude (LONG_W) for the largest Northern 
Latitude (LAT_N) in STATION that is less than 137.2345. 
Round your answer to 4 decimal places.
*/
SELECT ROUND(LONG_W,4)
FROM STATION
WHERE LAT_N = (
    SELECT MAX(LAT_N) 
FROM STATION WHERE LAT_N < 137.2345
);

In [ ]:
# Weather Observation Station 16
/*
Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7780. 
Round your answer to 4 decimal places.
*/
Select round(min(lat_n), 4) 
from station where lat_n > 38.7780;

In [ ]:
# Weather Observation Station 17
/*
Query the Western Longitude (LONG_W)where the smallest Northern
Latitude (LAT_N) in STATION is greater than 38.7780. 
Round your answer to 4 decimal places.
*/
Select round(LONG_W, 4) 
from station where lat_n=(
select min(lat_n) from station
where lat_n > 38.7780
);

In [ ]:
# Weather Observation Station 18
SELECT
    ROUND(ABS(MAX(LAT_N)  - MIN(LAT_N))
        + ABS(MAX(LONG_W) - MIN(LONG_W)), 4)
FROM 
    STATION;

In [ ]:
# Weather Observation Station 19

SELECT
    ROUND(SQRT(
        POWER(MAX(LAT_N)  - MIN(LAT_N),  2)
      + POWER(MAX(LONG_W) - MIN(LONG_W), 2)
    ), 4)
FROM 
    STATION;

In [ ]:
#Weather Observation Station 20
/*
A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) 
from STATION and round your answer to  decimal places.
*/
Select round(S.LAT_N,4) from station AS S where (select count(Lat_N) from station 
where Lat_N < S.LAT_N ) = (select count(Lat_N) from station where Lat_N > S.LAT_N);

In [ ]:
#Average Population of Each Continent
/*
Given the CITY and COUNTRY tables, query the names of all the 
continents (COUNTRY.Continent) and their respective average 
city populations (CITY.Population) rounded down to the nearest integer.

Note: CITY.CountryCode and COUNTRY.Code are matching key columns.
*/
SELECT Country.Continent, FLOOR(AVG(City.Population))
FROM Country, City 
WHERE Country.Code = City.CountryCode 
GROUP BY Country.Continent ;

In [ ]:
# Basic Join The Report

SELECT IF(GRADES.GRADE>=8, STUDENTS.NAME, NULL),GRADES.GRADE, STUDENTS.MARKS
FROM GRADES, STUDENTS
WHERE STUDENTS.MARKS BETWEEN GRADES.MIN_MARK AND GRADES.MAX_MARK
ORDER BY GRADES.GRADE DESC, STUDENTS.NAME;

In [ ]:
# Basic Join Ollivander's Inventory
SELECT a.id, 
   b.age, 
    a.coins_needed, 
    a.power 
FROM wands a 
   JOIN wands_property b 
     ON a.code = b.code 
WHERE  b.is_evil = 0 
    AND a.coins_needed = (SELECT Min(a1.coins_needed) 
    FROM   wands a1 
        JOIN wands_property b1 
          ON a1.code = b1.code 
    WHERE  b.age = b1.age 
        AND a.power = a1.power) 
ORDER  BY a.power DESC, 
          b.age DESC;

In [ ]:
# Basic Join Challenges
/*
Julia asked her students to create some coding challenges. 
Write a query to print the hacker_id, name, and the total 
number of challenges created by each student. 
Sort your results by the total number of challenges in 
descending order. If more than one student created the same 
number of challenges, then sort the result by hacker_id. 
If more than one student created the same number of challenges 
and the count is less than the maximum number of challenges 
created, then exclude those students from the result.
*/

SELECT h.hacker_id, 
       h.name, 
       COUNT(c.challenge_id) AS c_count
FROM Hackers h
JOIN Challenges c ON c.hacker_id = h.hacker_id
GROUP BY h.hacker_id, h.name
HAVING c_count = 
    (SELECT COUNT(c2.challenge_id) AS c_max
     FROM challenges as c2 
     GROUP BY c2.hacker_id 
     ORDER BY c_max DESC limit 1)
OR c_count IN 
    (SELECT DISTINCT c_compare AS c_unique
     FROM (SELECT h2.hacker_id, 
                  h2.name, 
                  COUNT(challenge_id) AS c_compare
           FROM Hackers h2
           JOIN Challenges c ON c.hacker_id = h2.hacker_id
           GROUP BY h2.hacker_id, h2.name) counts
     GROUP BY c_compare
     HAVING COUNT(c_compare) = 1)
ORDER BY c_count DESC, h.hacker_id;